posts/arch-and-ubuntu-side-by-side-on-encrypted-btrfs.org
#+BEGIN_COMMENT
.. title: Arch and Ubuntu side-by-side on encrypted btrfs
.. slug: arch-and-ubuntu-side-by-side-on-encrypted-btrfs
.. date: 2018-04-28 09:17:26 UTC-05:00
.. tags: linux
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT


* background

I've used Arch linux for about 8 years from [[https://bbs.archlinux.org/profile.php?id=35588][what I can tell]]. I love the minimalistic
nature, and also think =pacman= and =pacaur= are pretty great for package management. Arch
doesn't give me stuff I don't need, stays out of my way, and has [[https://wiki.archlinux.org/][fantastic
documentation]]. That said, at work I need Ubuntu due to some pre-built binary availability
and the lack of desire to build all of them each time they update. I decided to go with
both so I could use Ubuntu for specific tasks and Arch for my daily driver.

I was curious if I could use =btrfs= to create one main shared space for both, choosing
which subvolume to mount at boot. This eliminates the need to partition the disk and guess
sizes for each. I also encrypt my drives, so it required the ability to create an
encrypted container on =btrfs= and point the bootloader to that specific container based
no which distro I was booting. Lastly, my newest company issued computer shipped with UEFI
and Secure Boot, which was entirely new to me.

About ~15hrs later, I've got base systems installed and am feeling pretty happy.

#+begin_export html
<!-- TEASER_END -->
#+end_export

* hardware

I first went through this (minus UEFI stuff) on an HP Zbook 15 G2 and I'm using a Zbook 15
G4 to recreate the setup and write this guide (I didn't take very good notes last
time). I'm using a [[https://www.amazon.com/dp/B01LYFKX41/ref=twister_B01N78T39B?_encoding=UTF8&psc=1][Samsung NVM3 M.2]] as my install target.

I won't cover making your install media, but as a heads up, to even boot my USB install
media with Secure Boot in place, I had to follow [[https://unix.stackexchange.com/questions/320078/how-to-boot-arch-linux-installation-medium-with-secure-boot-enabled][these instructions]] on modifying the image
with a couple signed =.efi= files, and upon boot I followed [[https://wiki.archlinux.org/index.php/Secure_Boot#Booting_archiso][these steps]] to enroll the
USB's hashes with Secure Boot.

* prepping the drive

This is pretty straightforward stuff, though I ended up doing all of this /twice/ because
I didn't realize one gotcha. When it comes to partitioning, the bootloader will need to
live on the EFI System Partition (esp). I interpreted [[https://wiki.archlinux.org/index.php/Category:Boot_loaders][the wiki on bootloaders]] to believe
that the one I choose, rEFInd, could read from various filesystems like =ext4=.

In actuality, it seems the loader/esp /must/ live on =vfat=, but from there it can load
things (kernel image, initramfs) from other filesystems. Why does this matter? Well, I
didn't know that you can't sym/hard link on =vfat=. When it comes to ubuntu, I like to
maintain a symlink from =vmlinuz-xenial= to the versioned name of the latest kernel. This
avoids having to change the bootloader entry all the time with the new numbers. This is
probably fringe, and maybe not worth the effort, but it bothers me and this will stick
with me. I opted to go through the pain now and keep the flexibility!

For actual steps:

- I wiped the drive with random data using the =cryptsetup= container and =/dev/zero=
  [[https://wiki.archlinux.org/index.php/Dm-crypt/Drive_preparation][method]]
- partition the disk, creating an esp ([[https://wiki.archlinux.org/index.php/EFI_System_Partition][EFI system partition]]), separate =/boot= partition (if
  you desire), and main container for =btrfs=. Be sure to use =gpt=, not =mbr= for for the
  partition table!

#+begin_example  
# fdisk -l
Device           Start       End   Sectors   Size Type
/dev/nvme0n1p1    2048   1050623   1048576   512M EFI System
/dev/nvme0n1p2 1050624   3147775   2097152     1G Linux filesystem
/dev/nvme0n1p3 2099200 488397134 486297935 231.9G Linux filesystem

# mkfs.fat -F32 /dev/nvme0n1p1
# mkfs.ext4 /dev/nvme0n1p2
#+end_example

- [[https://wiki.archlinux.org/index.php/Dm-crypt/Device_encryption#Encryption_options_for_LUKS_mode][create]] and open the encrypted device and [[https://wiki.archlinux.org/index.php/Btrfs#File_system_on_a_single_device][format]] as =btrfs=.

#+begin_example

# cryptsetup -v --cipher aes-xts-plain64 --key-size 512 --hash sha512 --iter-time 2000 \
                --use-urandom -y luksFormat /dev/nvme0n1p2

# cryptsetup open /dev/nvme0n1p3 root
# mkfs.btrfs /dev/mapper/root
#+end_example

With that done, we're ready for installs. For what it's worth, I've arch first, then
ubuntu, and vice versa and have yet to get ubuntu to succeed on the install. I couldn't
find an way to disable the bootloader install altogether, and on two occasions tried
pointing it at both my EFI partition as well as the =ext4= one for the bootloader and both
failed. In looking around, it [[https://askubuntu.com/questions/689595/bootloader-install-failed][may be due]] to Secure Boot. I gave up and write the rest of
this with respect to installing arch first, then ubuntu.

