blog/arch-and-ubuntu-side-by-side-on-encrypted-btrfs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Arch and Ubuntu side-by-side on encrypted btrfs | jwhendy</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://jwhendy.github.io/blog/arch-and-ubuntu-side-by-side-on-encrypted-btrfs/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="John Henderson">
<link rel="prev" href="../comparing-python-plotting-libraries/" title="Comparing python plotting libraries" type="text/html">
<meta property="og:site_name" content="jwhendy">
<meta property="og:title" content="Arch and Ubuntu side-by-side on encrypted btrfs">
<meta property="og:url" content="https://jwhendy.github.io/blog/arch-and-ubuntu-side-by-side-on-encrypted-btrfs/">
<meta property="og:description" content="background


I've used Arch linux for about 8 years from what I can tell. I love the minimalistic
nature, and also think pacman and pacaur are pretty great for package management. Arch
doesn't give me">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-04-28T09:17:26-05:00">
<meta property="article:tag" content="linux">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<div class="navbar navbar-static-top" id="navbar">
    <div class="navbar-inner">
        <div class="container">

        <!-- .btn-navbar is used as the toggle for collapsed navbar content -->
        <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
        </a>

            <a class="brand" href="https://jwhendy.github.io/">

                <span id="blog-title">jwhendy</span>
            </a>
            <!-- Everything you want hidden at 940px or less, place within here -->
            <div class="nav-collapse collapse">
                <ul class="nav">
<li>
<a href="../../portfolio/">portfolio</a>
                </li>
<li>
<a href="../">blog</a>
                </li>
<li>
<a href="../../categories/">tags</a>

                    
                </li>
</ul>
<ul class="nav pull-right">
<li>
    </li>
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
                </ul>
</div>
        </div>
    </div>
</div>
<!-- End of Menubar -->
<div class="container-fluid" id="content" role="main">
    <!--Body content-->
    <div class="row-fluid">
    <div class="span2"></div>
    <div class="span8">
    
    
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Arch and Ubuntu side-by-side on encrypted btrfs</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    John Henderson
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2018-04-28T09:17:26-05:00" itemprop="datePublished" title="2018-04-28 09:17">2018-04-28 09:17</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org6cb3663" class="outline-2">
<h2 id="org6cb3663">background</h2>
<div class="outline-text-2" id="text-org6cb3663">
<p>
I've used Arch linux for about 8 years from <a href="https://bbs.archlinux.org/profile.php?id=35588">what I can tell</a>. I love the minimalistic
nature, and also think <code>pacman</code> and <code>pacaur</code> are pretty great for package management. Arch
doesn't give me stuff I don't need, stays out of my way, and has <a href="https://wiki.archlinux.org/">fantastic
documentation</a>. That said, at work I need Ubuntu due to some pre-built binary availability
and the lack of desire to build all of them each time they update. I decided to go with
both so I could use Ubuntu for specific tasks and Arch for my daily driver.
</p>

<p>
I was curious if I could use <code>btrfs</code> to create one main shared space for both, choosing
which subvolume to mount at boot. This eliminates the need to partition the disk and guess
sizes for each. I also encrypt my drives, so it required the ability to create an
encrypted container on <code>btrfs</code> and point the bootloader to that specific container based
no which distro I was booting. Lastly, my newest company issued computer shipped with UEFI
and Secure Boot, which was entirely new to me.
</p>

<p>
About ~15hrs later, I've got base systems installed and am feeling pretty happy.
</p>

<!-- TEASER_END -->
</div>
</div>

<div id="outline-container-org37659c0" class="outline-2">
<h2 id="org37659c0">hardware</h2>
<div class="outline-text-2" id="text-org37659c0">
<p>
I first went through this (minus UEFI stuff) on an HP Zbook 15 G2 and I'm using a Zbook 15
G4 to recreate the setup and write this guide (I didn't take very good notes last
time). I'm using a <a href="https://www.amazon.com/dp/B01LYFKX41/ref=twister_B01N78T39B?_encoding=UTF8&amp;psc=1">Samsung NVM3 M.2</a> as my install target.
</p>

<p>
I won't cover making your install media, but as a heads up, to even boot my USB install
media with Secure Boot in place, I had to follow <a href="https://unix.stackexchange.com/questions/320078/how-to-boot-arch-linux-installation-medium-with-secure-boot-enabled">these instructions</a> on modifying the image
with a couple signed <code>.efi</code> files, and upon boot I followed <a href="https://wiki.archlinux.org/index.php/Secure_Boot#Booting_archiso">these steps</a> to enroll the
USB's hashes with Secure Boot.
</p>
</div>
</div>

<div id="outline-container-org5461c88" class="outline-2">
<h2 id="org5461c88">prepping the drive</h2>
<div class="outline-text-2" id="text-org5461c88">
<p>
This is pretty straightforward stuff, though I ended up doing all of this <i>twice</i> because
I didn't realize one gotcha. When it comes to partitioning, the bootloader will need to
live on the EFI System Partition (esp). I interpreted <a href="https://wiki.archlinux.org/index.php/Category:Boot_loaders">the wiki on bootloaders</a> to believe
that the one I choose, rEFInd, could read from various filesystems like <code>ext4</code>.
</p>

<p>
In actuality, it seems the loader/esp <i>must</i> live on <code>vfat</code>, but from there it can load
things (kernel image, initramfs) from other filesystems. Why does this matter? Well, I
didn't know that you can't sym/hard link on <code>vfat</code>. When it comes to ubuntu, I like to
maintain a symlink from <code>vmlinuz-xenial</code> to the versioned name of the latest kernel. This
avoids having to change the bootloader entry all the time with the new numbers. This is
probably fringe, and maybe not worth the effort, but it bothers me and this will stick
with me. I opted to go through the pain now and keep the flexibility!
</p>

<p>
For actual steps:
</p>

<ul class="org-ul">
<li>I wiped the drive with random data using the <code>cryptsetup</code> container and <code>/dev/zero</code>
<a href="https://wiki.archlinux.org/index.php/Dm-crypt/Drive_preparation">method</a>
</li>
<li>partition the disk, creating an esp (<a href="https://wiki.archlinux.org/index.php/EFI_System_Partition">EFI system partition</a>), separate <code>/boot</code> partition (if
you desire), and main container for <code>btrfs</code>. Be sure to use <code>gpt</code>, not <code>mbr</code> for for the
partition table!</li>
</ul>
<pre class="example">
# fdisk -l
Device           Start       End   Sectors   Size Type
/dev/nvme0n1p1    2048   1050623   1048576   512M EFI System
/dev/nvme0n1p2 1050624   3147775   2097152     1G Linux filesystem
/dev/nvme0n1p3 2099200 488397134 486297935 231.9G Linux filesystem

# mkfs.fat -F32 /dev/nvme0n1p1
# mkfs.ext4 /dev/nvme0n1p2
</pre>

<ul class="org-ul">
<li>
<a href="https://wiki.archlinux.org/index.php/Dm-crypt/Device_encryption#Encryption_options_for_LUKS_mode">create</a> and open the encrypted device and <a href="https://wiki.archlinux.org/index.php/Btrfs#File_system_on_a_single_device">format</a> as <code>btrfs</code>.</li>
</ul>
<pre class="example">

# cryptsetup -v --cipher aes-xts-plain64 --key-size 512 --hash sha512 --iter-time 2000 \
                --use-urandom -y luksFormat /dev/nvme0n1p2

# cryptsetup open /dev/nvme0n1p3 root
# mkfs.btrfs /dev/mapper/root
</pre>

<p>
With that done, we're ready for installs. For what it's worth, I've arch first, then
ubuntu, and vice versa and have yet to get ubuntu to succeed on the install. I couldn't
find an way to disable the bootloader install altogether, and on two occasions tried
pointing it at both my EFI partition as well as the <code>ext4</code> one for the bootloader and both
failed. In looking around, it <a href="https://askubuntu.com/questions/689595/bootloader-install-failed">may be due</a> to Secure Boot. I gave up and write the rest of
this with respect to installing arch first, then ubuntu.
</p>
</div>
</div>
