posts/arch-and-ubuntu-side-by-side-on-encrypted-btrfs.org
* installing arch

We need to create the subvolumes we'd like to use, as well as the boot structure. I used
the following for my =btrfs= setup (we'll create subvols for ubuntu later):

#+begin_example 
/arch: arch system
/vault: repository for shared data
/jwhendy: separate arch home dir which I also mount at /mnt/homie for ubuntu access
#+end_example

Here we make the subvolumes and then re-mount the arch root target for installation:

#+begin_example 
# cryptsetup open /dev/nvme0n1p3 root
# mount /dev/mapper/root /mnt

# btrfs subvol create /mnt/arch
# btrfs subvol create /mnt/jwhendy
# btrfs subvol create /mnt/vault

# umount /mnt
# mount -t btrfs -o subvol=/arch /dev/mapper/root /mnt

#+end_example

In addition, we need to make mount =/boot= and our esp. As mentioned above, having =/boot=
be =ext4= will let us symlink and do whatever we'd like with =/boot= itself, while
=rEFInd= can be happy on =/boot/efi=. 

#+begin_example
# mkdir /mnt/boot
# mount /dev/nvme0n1p2 /mnt/boot
# mkdir /mnt/boot/efi
# mount /dev/nvme0n1p1 /mnt/boot/efi
#+end_example

Follow the rest of the [[https://wiki.archlinux.org/index.php/installation_guide#Installation][installation instructions]] to install =base= packages, then
=arch-chroot= into =/mnt=. For =mkinitcipio=, I use the following:

#+begin_example 
MODULES=(dm_crypt aes_x86_64 dm_mod sd_mod crc32c_intel vfat btrfs nvidia)
HOOKS=(systemd autodetect modconf block sd-encrypt filesystems keyboard fsck)
#+end_example

Be sure to install any other packages you want/need, for example =nvidia=, =btrfs-progs=,
wireless tools, etc.

* bootloader setup

For the bootloader, I'm going with [[https://wiki.archlinux.org/index.php/REFInd][=rEFInd=]], (=refind-efi= package). Since I have Secure
Boot enabled, I had to do a few more things like installing [[https://aur.archlinux.org/packages/shim-signed/][=shim-signed=]] (AUR), which
required installing =base-devel= so I could install =pacaur= (which also required
=cower=).  

This was definitely the most complicated topic of anything I did, in part because it's
split between universal info like the [[https://wiki.archlinux.org/index.php/EFI_System_Partition][EFI System Partition]], the [[https://wiki.archlinux.org/index.php/REFInd][bootloader itself]],
specifics about [[https://wiki.archlinux.org/index.php/Secure_Boot][Secure Boot]], and [[http://www.rodsbooks.com/efi-bootloaders/secureboot.html][external references]] that the arch wiki points to.

If I understand things correctly, there are [[http://www.rodsbooks.com/efi-bootloaders/secureboot.html#using_signed][two methods]] to work around Secure Boot. One (=PreLoader=)
checks the hashes of various binaries to make sure they are trusted, the other (=shim=) relies on
the binary being signed by a trusted key (and /maybe/ also does hashed?).

I originally went with the preloader method, but found that ubuntu would not load =nvidia=
drivers because they weren't signed by a trusted key. I've now switched to =shim= and
/think/ it's working! I'll recommend that way, and the article from Rod Smith suggests
=shim= is more flexible as well.

I'm following the portion of the wiki about [[https://wiki.archlinux.org/index.php/REFInd#Using_shim][using shim]]. Refer to that, but summarized,
this is what I did:

- install =shim-signed=
- follow instructions on [[https://wiki.archlinux.org/index.php/Secure_Boot#shim_with_key][shim with key]] (at this point I've created my user on arch, so I'm
  in =/home/jwhendy=)

#+begin_example
$ mkdir .ssl
$ cd .ssl
$ openssl req -newkey rsa:2048 -nodes -keyout mok_arch.key -new -x509 -sha256 -days 3650 -subj "/CN=arch_mok_key/" -out mok_arch.crt
$ openssl x509 -outform DER -in mok_arch.crt -out mok_arch.cer
#+end_example

Per the tip in using shim with =rEFInd=, you can put these keys in =/etc/refind.d/keys= to
install them automatically to the esp:

#+begin_example 
$ sudo mkdir -p /etc/refind.d/keys
$ sudo cp ./mok_arch.key /etc/refind.d/keys/refind_local.key
$ sudo cp ./mok_arch.cer /etc/refind.d/keys/refind_local.cer
$ sudo cp ./mok_arch.crt /etc/refind.d/keys/refind_local.crt
#+end_example 

- now we install =refind=:

#+begin_example
$ sudo refind-install --shim /usr/share/shim-signed/shim.efi --localkeys
#+end_example

I /think/ this signs =shim.efi= with our key. In addition, it copies the =.cer= and =.crt=
to =efi/EFI/refind/keys= so that we can load them into the trusted key database. My
understanding is that once enrolled, the system will trust things signed by that key/cert
pair. 

Make sure you're good with any adds to =mkinitcpio= as that will generate a new
=vmlinuz-linux= loader which needs to be signed.

#+begin_example
$ cd /boot
$ sudo sbsign --key ~/.ssl/mok_arch.key --cert ~/.ssl/mok_arch.crt --output ./vmlinuz-linux ./vmlinux-linux
#+end_example

For setting up =refind.conf=, my entry looks like this:

#+begin_example 
menuentry "arch" {
    icon         /EFI/refind/icons/os_arch.png
    volume       BOOT_PARTUUID
    loader       /boot/vmlinuz-linux
    initrd       /boot/initramfs-linux.img
    options      "luks.uuid=DEVICE_UUID root=UUID=MAPPER_UUID rootflags=compress=lzo,discard,ssd,subvol=arch luks.allow=discards add_efi_memmap rw"
}
#+end_example

For DEVICE_UUID and MAPPER_UUID, use =blkid=

#+begin_example
# use the boot device (not the ESP) for the volume entry; it tells refind where the kernel is
/dev/nvme0n1p2: UUID="5efd2b85-7d45-46f4-8407-1f08cca9847f" TYPE="vfat" PARTUUID="5bb27fc4-dbf4-4157-bf94-8dba1fcdabdf"

# use the physical device UUID for luks.uuid
/dev/nvme0n1p3: UUID="0712af67-3f01-4dde-9d45-194df9d29d14" TYPE="crypto_LUKS" PARTUUID="80262d8f-fc26-45a7-ad8d-1a5bad414250"

# use the mapped UUID for the root UUID
/dev/mapper/root: UUID="204e2670-ca9a-41fb-b487-2b32076033b1" UUID_SUB="fbd1fe45-760b-4c6e-a17f-74b8cd60edb6" TYPE="btrfs"
#+end_example  

It took me a while to get this right; use the following for the entries in your =refind.conf=:
- volume: PARTUUID of the boot partition, not the esp
- DEVICE_UUID: UUID of the raw partition
- MAPPER_UUID: UUID that's assigned to the /opened/ cryptdevice

Cross your fingers and reboot!

Upon reboot, get to your boot device screen and choose the UEFI rEFInd entry. I got an
error about it not being authorized, and then an option to start the MOK utility. I choose to enroll
keys and then picked the one, really long entry (the others were from the =ARCHISO= or
maybe elsewhere). Navigate to =EFI/refind/keys= and enroll the =.cer= file.

Reboot again and you should be all set.

As an aside, for long term use (which I haven't looked into yet), I'll be pursuing [[https://wiki.archlinux.org/index.php/Secure_Boot#Signing_kernel_with_pacman_hook][a hook]]
to sign the kernel image each time it updates. To test how this works, after successfully
booting with a signed =vmlinuz-linux= I updated the =linux= package manually and booting
failed. I /was/ able to use the MOK utility to enter the hash of =vmlinuz-linux= and then
boot. So, I think going forward there are two options: sign the kernel, or deal with
enrolling the hash at boot each time it updates.

