blog/arch-and-ubuntu-side-by-side-on-encrypted-btrfs/index.html

<div id="outline-container-orga4b115b" class="outline-2">
<h2 id="orga4b115b">installing arch</h2>
<div class="outline-text-2" id="text-orga4b115b">
<p>
We need to create the subvolumes we'd like to use, as well as the boot structure. I used
the following for my <code>btrfs</code> setup (we'll create subvols for ubuntu later):
</p>

<pre class="example">
/arch: arch system
/vault: repository for shared data
/jwhendy: separate arch home dir which I also mount at /mnt/homie for ubuntu access
</pre>

<p>
Here we make the subvolumes and then re-mount the arch root target for installation:
</p>

<pre class="example">
# cryptsetup open /dev/nvme0n1p3 root
# mount /dev/mapper/root /mnt

# btrfs subvol create /mnt/arch
# btrfs subvol create /mnt/jwhendy
# btrfs subvol create /mnt/vault

# umount /mnt
# mount -t btrfs -o subvol=/arch /dev/mapper/root /mnt

</pre>

<p>
In addition, we need to make mount <code>/boot</code> and our esp. As mentioned above, having <code>/boot</code>
be <code>ext4</code> will let us symlink and do whatever we'd like with <code>/boot</code> itself, while
<code>rEFInd</code> can be happy on <code>/boot/efi</code>. 
</p>

<pre class="example">
# mkdir /mnt/boot
# mount /dev/nvme0n1p2 /mnt/boot
# mkdir /mnt/boot/efi
# mount /dev/nvme0n1p1 /mnt/boot/efi
</pre>

<p>
Follow the rest of the <a href="https://wiki.archlinux.org/index.php/installation_guide#Installation">installation instructions</a> to install <code>base</code> packages, then
<code>arch-chroot</code> into <code>/mnt</code>. For <code>mkinitcipio</code>, I use the following:
</p>

<pre class="example">
MODULES=(dm_crypt aes_x86_64 dm_mod sd_mod crc32c_intel vfat btrfs nvidia)
HOOKS=(systemd autodetect modconf block sd-encrypt filesystems keyboard fsck)
</pre>

<p>
Be sure to install any other packages you want/need, for example <code>nvidia</code>, <code>btrfs-progs</code>,
wireless tools, etc.
</p>
</div>
</div>

<div id="outline-container-orge5335a6" class="outline-2">
<h2 id="orge5335a6">bootloader setup</h2>
<div class="outline-text-2" id="text-orge5335a6">
<p>
For the bootloader, I'm going with <a href="https://wiki.archlinux.org/index.php/REFInd"><code>rEFInd</code></a>, (<code>refind-efi</code> package). Since I have Secure
Boot enabled, I had to do a few more things like installing <a href="https://aur.archlinux.org/packages/shim-signed/"><code>shim-signed</code></a> (AUR), which
required installing <code>base-devel</code> so I could install <code>pacaur</code> (which also required
<code>cower</code>).  
</p>

<p>
This was definitely the most complicated topic of anything I did, in part because it's
split between universal info like the <a href="https://wiki.archlinux.org/index.php/EFI_System_Partition">EFI System Partition</a>, the <a href="https://wiki.archlinux.org/index.php/REFInd">bootloader itself</a>,
specifics about <a href="https://wiki.archlinux.org/index.php/Secure_Boot">Secure Boot</a>, and <a href="http://www.rodsbooks.com/efi-bootloaders/secureboot.html">external references</a> that the arch wiki points to.
</p>

<p>
If I understand things correctly, there are <a href="http://www.rodsbooks.com/efi-bootloaders/secureboot.html#using_signed">two methods</a> to work around Secure Boot. One (<code>PreLoader</code>)
checks the hashes of various binaries to make sure they are trusted, the other (<code>shim</code>) relies on
the binary being signed by a trusted key (and <i>maybe</i> also does hashed?).
</p>

<p>
I originally went with the preloader method, but found that ubuntu would not load <code>nvidia</code>
drivers because they weren't signed by a trusted key. I've now switched to <code>shim</code> and
<i>think</i> it's working! I'll recommend that way, and the article from Rod Smith suggests
<code>shim</code> is more flexible as well.
</p>

<p>
I'm following the portion of the wiki about <a href="https://wiki.archlinux.org/index.php/REFInd#Using_shim">using shim</a>. Refer to that, but summarized,
this is what I did:
</p>

<ul class="org-ul">
<li>install <code>shim-signed</code>
</li>
<li>follow instructions on <a href="https://wiki.archlinux.org/index.php/Secure_Boot#shim_with_key">shim with key</a> (at this point I've created my user on arch, so I'm
in <code>/home/jwhendy</code>)</li>
</ul>
<pre class="example">
$ mkdir .ssl
$ cd .ssl
$ openssl req -newkey rsa:2048 -nodes -keyout mok_arch.key -new -x509 -sha256 -days 3650 -subj "/CN=arch_mok_key/" -out mok_arch.crt
$ openssl x509 -outform DER -in mok_arch.crt -out mok_arch.cer
</pre>

<p>
Per the tip in using shim with <code>rEFInd</code>, you can put these keys in <code>/etc/refind.d/keys</code> to
install them automatically to the esp:
</p>

<pre class="example">
$ sudo mkdir -p /etc/refind.d/keys
$ sudo cp ./mok_arch.key /etc/refind.d/keys/refind_local.key
$ sudo cp ./mok_arch.cer /etc/refind.d/keys/refind_local.cer
$ sudo cp ./mok_arch.crt /etc/refind.d/keys/refind_local.crt
</pre>

<ul class="org-ul">
<li>now we install <code>refind</code>:</li>
</ul>
<pre class="example">
$ sudo refind-install --shim /usr/share/shim-signed/shim.efi --localkeys
</pre>

<p>
I <i>think</i> this signs <code>shim.efi</code> with our key. In addition, it copies the <code>.cer</code> and <code>.crt</code>
to <code>efi/EFI/refind/keys</code> so that we can load them into the trusted key database. My
understanding is that once enrolled, the system will trust things signed by that key/cert
pair. 
</p>

<p>
Make sure you're good with any adds to <code>mkinitcpio</code> as that will generate a new
<code>vmlinuz-linux</code> loader which needs to be signed.
</p>

<pre class="example">
$ cd /boot
$ sudo sbsign --key ~/.ssl/mok_arch.key --cert ~/.ssl/mok_arch.crt --output ./vmlinuz-linux ./vmlinux-linux
</pre>

<p>
For setting up <code>refind.conf</code>, my entry looks like this:
</p>

<pre class="example">
menuentry "arch" {
    icon         /EFI/refind/icons/os_arch.png
    volume       BOOT_PARTUUID
    loader       /vmlinuz-linux
    initrd       /initramfs-linux.img
    options      "luks.uuid=DEVICE_UUID root=UUID=MAPPER_UUID rootflags=compress=lzo,discard,ssd,subvol=arch luks.allow=discards add_efi_memmap rw"
}
</pre>

<p>
For DEVICE<sub>UUID</sub> and MAPPER<sub>UUID</sub>, use <code>blkid</code>
</p>

<pre class="example">
# use the boot device (not the ESP) for the volume entry; it tells refind where the kernel is
/dev/nvme0n1p2: UUID="5efd2b85-7d45-46f4-8407-1f08cca9847f" TYPE="vfat" PARTUUID="5bb27fc4-dbf4-4157-bf94-8dba1fcdabdf"

# use the physical device UUID for luks.uuid
/dev/nvme0n1p3: UUID="0712af67-3f01-4dde-9d45-194df9d29d14" TYPE="crypto_LUKS" PARTUUID="80262d8f-fc26-45a7-ad8d-1a5bad414250"

# use the mapped UUID for the root UUID
/dev/mapper/root: UUID="204e2670-ca9a-41fb-b487-2b32076033b1" UUID_SUB="fbd1fe45-760b-4c6e-a17f-74b8cd60edb6" TYPE="btrfs"
</pre>

<p>
It took me a while to get this right; use the following for the entries in your <code>refind.conf</code>:
</p>
<ul class="org-ul">
<li>volume: PARTUUID of the boot partition, not the esp</li>
<li>DEVICE<sub>UUID</sub>: UUID of the raw partition</li>
<li>MAPPER<sub>UUID</sub>: UUID that's assigned to the <i>opened</i> cryptdevice</li>
</ul>
<p>
Cross your fingers and reboot!
</p>

<p>
Upon reboot, get to your boot device screen and choose the UEFI rEFInd entry. I got an
error about it not being authorized, and then an option to start the MOK utility. I choose to enroll
keys and then picked the one, really long entry (the others were from the <code>ARCHISO</code> or
maybe elsewhere). Navigate to <code>EFI/refind/keys</code> and enroll the <code>.cer</code> file.
</p>

<p>
Reboot again and you should be all set.
</p>

<p>
As an aside, for long term use (which I haven't looked into yet), I'll be pursuing <a href="https://wiki.archlinux.org/index.php/Secure_Boot#Signing_kernel_with_pacman_hook">a hook</a>
to sign the kernel image each time it updates. To test how this works, after successfully
booting with a signed <code>vmlinuz-linux</code> I updated the <code>linux</code> package manually and booting
failed. I <i>was</i> able to use the MOK utility to enter the hash of <code>vmlinuz-linux</code> and then
boot. So, I think going forward there are two options: sign the kernel, or deal with
enrolling the hash at boot each time it updates.
</p>
</div>
</div>
