posts/arch-and-ubuntu-side-by-side-on-encrypted-btrfs.org
* install ubuntu

Boot into Ubuntu and choose the option to try it (not install). Open a terminal and open
the existing crypt device:

#+begin_example
$ sudo cryptsetup open /dev/nvme0n1p3 root
#+end_example

Now you can double click the installer icon on the desktop. I didn't find any good answers
on how to prevent ubuntu from trying to install a bootloader altogether, and you also
don't get to pick a subvolume to install to, which is why we didn't create them earlier.

Go throug the setup, choosing "something else" on the installation type screen:

- point to your opened crypt device (e.g. =/dev/mapper/root=), click change, select it as
  a btrfs filesystem and =/= for the mount point
- We're using =rEFInd= to load both arch and ubuntu, but you have to tell it something, so
  I pointed it at =/dev/nvm0n1p2= (=ext4= partition) to make it happy
- to move on, you'll get warnings about no swap and should confirm that it won't make any
  changes to the partition table and won't be formatting anything
- go through with the rest of the install

The install failed to install =grub=, then popped up a dialog about it and said the
installer crashed. I couldn't close it. Things still worked fine for me.

It seems that ubuntu insists on making it's own new subvols, which we'll move now. After
the installer borked, I found 

#+begin_example 
$ sudo mount /dev/mapper/root /mnt
$ sudo mv /mnt/@ /mnt/xenial
$ sudo rm -r /mnt/xenial/home
$ sudo mv /mnt/@home /mnt/xenial/home
$ sudo rm -r /mnt/var
$ sudo rm -r /mnt/ubiquity-apt-clone
#+end_example

For the final setup, I find it easier to just =chroot=, so that's what I'd suggest:

#+begin_example
$ sudo umount /mnt
$ sudo mount -o subvol=xenial /dev/mapper/root /mnt
#+end_example

Now mount =/dev/nvme0n1p2= somewhere and copy in =initrd-xxx= and =vmlinuz-xxx= from the
ubuntu =/boot= dir in there. 

#+begin_example
$ mkdir ~/boot
$ sudo mount /dev/nvme0n1p2 ~/boot
$ sudo cp /mnt/boot/initrd.img-4.* ~/boot/
$ sudo cp /mnt/boot/vmlinuz-4.* ~/boot/
#+end_example

You can copy everything if you wnat, but this all you need so I blew the rest away and
then remounted =~/boot= to =/mnt/boot=:

#+begin_example
$ sudo rm -r /mnt/boot/*
$ sudo umount ~/boot
$ sudo mount /dev/nvme0n1p2 /mnt/boot
$ sudo mount /dev/nvme0n1p1 /mnt/boot/efi

$ sudo mount -t proc /proc /mnt/proc
$ sudo mount --rbind /sys /mnt/sys
$ sudo mount --rbind /dev /mnt/dev
$ sudo cp /etc/resolv.conf /mnt/etc/resolv.conf
$ sudo chroot /mnt /bin/bash
# su username
#+end_example

I [[https://askubuntu.com/questions/860670/can-i-safely-remove-grub-after-installing-refind][removed everything]] related to =grub= and =grub2= since I'm using =rEFInd= to boot both arch
and ubuntu and don't want the shared =/boot= to get clobbered inadvertently, or for 
=grub= to try and install it's own bootloader

#+begin_example
$ apt list --installed |grep grub
$ sudo apt remove [all packages from above step]
#+end_example

The way ubuntu handles crypt devices is a little different than arch, so the =rEFInd=
entry is also slightly different:

#+begin_example 
menuentry "ubuntu" {
    icon         /EFI/refind/icons/os_ubuntu.png
    volume       BOOT_PARTUUID
    loader       /vmlinuz-xenial
    initrd       /initrd-linux.img
    options      "root=UUID=MAPPER_UUID rootflags=compress=lzo,discard,ssd,subvol=xenia luks.options=timeout=30s luks.allow=discards nomodeset $vt_handoff add_efi_memmap rw"
}
#+end_example

Note the use of =-xenial= files above for the kernel image/initrd. It's my personal
preference to maintain links to the most recent files so that I don't have to change my
boot entry at every update. I simply link these generic files to the versioned ones.

#+begin_example
$ cd /boot
$ sudo ln -s initrd.img-4.13.0-39-generic initrd-xenial.img
$ sudo ln -s vmlinuz-4.13.0-39-generic vmlinuz-xenial
#+end_example

Ubuntu also requires the use of =/etc/crypttab= to know what to decrypt, hence removing
our =luks.uuid= bit. Now we need these two entries:

#+begin_example
$ cat /etc/crypttab
root   UUID=DEVICE_UUID   none   luks,discard

$ cat /etc/fstab
/dev/mapper/root   /   btrfs   defaults,subvol=xenial   0 1
#+end_example

While you're at it, you may want to check that =/boot= and =/boot/efi= also have entries
in =fstab=. After making these changes, you have to rebuild the boot images:
=update-initramfs -u -k all=.

Reboot and cross your fingers! I didn't sign the image, but I wasn't prompted to enroll
anything, so perhaps ubuntu's images are pre-signed (the install media also doesn't
require fiddling like arch's).

* nvidia drivers

On ubuntu, =nvidia= drivers won't =modprobe= becuase [[https://askubuntu.com/questions/755238/why-disabling-secure-boot-is-enforced-policy-when-installing-3rd-party-modules][ubuntu uses]] the
=CONFIG_MODULE_SIG_FORCE= option in its kernel. We have to sign them with the keys we
enrolled earlier. 

#+begin_example 
$ sudo add-apt-repository ppa:graphics-drivers/ppa
$ sudo apt update
$ apt-cache search nvidia # find the package name you want
$ sudo apt install nvidia-390
#+end_example

I got burned at some point with hybrid graphics, so I just have them off. Because of that,
I don't want =nvidia-prime= and =bbswitch-dkms= installed.

#+begin_example 
$ sudo apt remove nvidia-prime bbswitch-dkms
#+end_example

We can just copy our keys from arch over to ubuntu.

#+begin_example 
$ sudo mount -o subvol=jwhendy /mnt
$ mkdir ~/.ssl
$ cp /mnt/.ssl/* ~/.ssl/
#+end_example

Lastly, we need to sign them. Ubuntu ships with it's own script for this, we we can just
use that. It's located at =/usr/src/linux-headers-$(uname -r)/scripts/sign-file=. I found
arch vs. ubuntu docs a little confusing in this respect. [[https://wiki.archlinux.org/index.php/Secure_Boot#Creating_keys][Arch generates]] a =.key= and
=.crt=, then converts the =.crt= into a DER format =.cer=. [[http://www.pellegrino.link/2015/11/29/signing-nvidia-proprietary-driver-on-fedora.html][References]] for [[https://computerlinguist.org/make-dkms-sign-kernel-modules-for-secure-boot-on-ubuntu-1604.html][how to]] do this
on ubuntu [[https://insights.ubuntu.com/2017/08/11/how-to-sign-things-for-secure-boot][generally show]] creating a =.priv= and =.der= directly. I used my best inference
to sign wit the ubuntu provided tool, using the =.key= and =.cer= created earlier. Repeat
the below with =nvidia*.ko= module:

#+begin_example 
$ cd /lib/modules/4.13.0-39-generic/updates/dkms
$ sudo /usr/src/linux-headers-4.13.0-39-generic/scripts/sign-file sha256 ~/.ssl/mok_arch.key ~/.ssl/mok_arch.cer nvidia-390.ko
#+end_example

Installing =nvidia= itself creates a file that blacklists =nouveau= so all you need to do
is reboot. If you get to a desktop from =lightdm=, it worked! You can verify with =lsmod=,
checking to make sure =nouveau= is not present and =nvidia= is.


* conclusion

So that's it! I /love/ using =btrfs= for this purpose, as you can easily recreate this
process with any number of distros. My use of ubuntu is for the [[http://www.ros.org/][Robot Operating System]]
(ROS) pre-compiled binaries, and with new releases coming from both [[http://wiki.ros.org/melodic][ROS]] and [[http://releases.ubuntu.com/18.04/][ubuntu]] coming,
this is perfect for not having to deal with re-partitioning, worrying about sizing, etc.

