blog/arch-and-ubuntu-side-by-side-on-encrypted-btrfs/index.html

<div id="outline-container-org349686a" class="outline-2">
<h2 id="org349686a">install ubuntu</h2>
<div class="outline-text-2" id="text-org349686a">
<p>
Boot into Ubuntu and choose the option to try it (not install). Open a terminal and open
the existing crypt device:
</p>

<pre class="example">
$ sudo cryptsetup open /dev/nvme0n1p3 root
</pre>

<p>
Now you can double click the installer icon on the desktop. I didn't find any good answers
on how to prevent ubuntu from trying to install a bootloader altogether, and you also
don't get to pick a subvolume to install to, which is why we didn't create them earlier.
</p>

<p>
Go throug the setup, choosing "something else" on the installation type screen:
</p>

<ul class="org-ul">
<li>point to your opened crypt device (e.g. <code>/dev/mapper/root</code>), click change, select it as
a btrfs filesystem and <code>/</code> for the mount point</li>
<li>We're using <code>rEFInd</code> to load both arch and ubuntu, but you have to tell it something, so
I pointed it at <code>/dev/nvm0n1p2</code> (<code>ext4</code> partition) to make it happy</li>
<li>to move on, you'll get warnings about no swap and should confirm that it won't make any
changes to the partition table and won't be formatting anything</li>
<li>go through with the rest of the install</li>
</ul>
<p>
The install failed to install <code>grub</code>, then popped up a dialog about it and said the
installer crashed. I couldn't close it. Things still worked fine for me.
</p>

<p>
It seems that ubuntu insists on making it's own new subvols, which we'll move now. After
the installer borked, I found 
</p>

<pre class="example">
$ sudo mount /dev/mapper/root /mnt
$ sudo mv /mnt/@ /mnt/xenial
$ sudo rm -r /mnt/xenial/home
$ sudo mv /mnt/@home /mnt/xenial/home
$ sudo rm -r /mnt/var
$ sudo rm -r /mnt/ubiquity-apt-clone
</pre>

<p>
For the final setup, I find it easier to just <code>chroot</code>, so that's what I'd suggest:
</p>

<pre class="example">
$ sudo umount /mnt
$ sudo mount -o subvol=xenial /dev/mapper/root /mnt
</pre>

<p>
Now mount <code>/dev/nvme0n1p2</code> somewhere and copy in <code>initrd-xxx</code> and <code>vmlinuz-xxx</code> from the
ubuntu <code>/boot</code> dir in there. 
</p>

<pre class="example">
$ mkdir ~/boot
$ sudo mount /dev/nvme0n1p2 ~/boot
$ sudo cp /mnt/boot/initrd.img-4.* ~/boot/
$ sudo cp /mnt/boot/vmlinuz-4.* ~/boot/
</pre>

<p>
You can copy everything if you wnat, but this all you need so I blew the rest away and
then remounted <code>~/boot</code> to <code>/mnt/boot</code>:
</p>

<pre class="example">
$ sudo rm -r /mnt/boot/*
$ sudo umount ~/boot
$ sudo mount /dev/nvme0n1p2 /mnt/boot
$ sudo mount /dev/nvme0n1p1 /mnt/boot/efi

$ sudo mount -t proc /proc /mnt/proc
$ sudo mount --rbind /sys /mnt/sys
$ sudo mount --rbind /dev /mnt/dev
$ sudo cp /etc/resolv.conf /mnt/etc/resolv.conf
$ sudo chroot /mnt /bin/bash
# su username
</pre>

<p>
I <a href="https://askubuntu.com/questions/860670/can-i-safely-remove-grub-after-installing-refind">removed everything</a> related to <code>grub</code> and <code>grub2</code> since I'm using <code>rEFInd</code> to boot both arch
and ubuntu and don't want the shared <code>/boot</code> to get clobbered inadvertently, or for 
<code>grub</code> to try and install it's own bootloader
</p>

<pre class="example">
$ apt list --installed |grep grub
$ sudo apt remove [all packages from above step]
</pre>

<p>
The way ubuntu handles crypt devices is a little different than arch, so the <code>rEFInd</code>
entry is also slightly different:
</p>

<pre class="example">
menuentry "ubuntu" {
    icon         /EFI/refind/icons/os_ubuntu.png
    volume       BOOT_PARTUUID
    loader       /vmlinuz-xenial
    initrd       /initrd-linux.img
    options      "root=UUID=MAPPER_UUID rootflags=compress=lzo,discard,ssd,subvol=xenia luks.options=timeout=30s luks.allow=discards nomodeset $vt_handoff add_efi_memmap rw"
}
</pre>

<p>
Note the use of <code>-xenial</code> files above for the kernel image/initrd. It's my personal
preference to maintain links to the most recent files so that I don't have to change my
boot entry at every update. I simply link these generic files to the versioned ones.
</p>

<pre class="example">
$ cd /boot
$ sudo ln -s initrd.img-4.13.0-39-generic initrd-xenial.img
$ sudo ln -s vmlinuz-4.13.0-39-generic vmlinuz-xenial
</pre>

<p>
Ubuntu also requires the use of <code>/etc/crypttab</code> to know what to decrypt, hence removing
our <code>luks.uuid</code> bit. Now we need these two entries:
</p>

<pre class="example">
$ cat /etc/crypttab
root   UUID=DEVICE_UUID   none   luks,discard

$ cat /etc/fstab
/dev/mapper/root   /   btrfs   defaults,subvol=xenial   0 1
</pre>

<p>
While you're at it, you may want to check that <code>/boot</code> and <code>/boot/efi</code> also have entries
in <code>fstab</code>. After making these changes, you have to rebuild the boot images:
<code>update-initramfs -u -k all</code>.
</p>

<p>
Reboot and cross your fingers! I didn't sign the image, but I wasn't prompted to enroll
anything, so perhaps ubuntu's images are pre-signed (the install media also doesn't
require fiddling like arch's).
</p>
</div>
</div>

<div id="outline-container-org91608e6" class="outline-2">
<h2 id="org91608e6">nvidia drivers</h2>
<div class="outline-text-2" id="text-org91608e6">
<p>
On ubuntu, <code>nvidia</code> drivers won't <code>modprobe</code> becuase <a href="https://askubuntu.com/questions/755238/why-disabling-secure-boot-is-enforced-policy-when-installing-3rd-party-modules">ubuntu uses</a> the
<code>CONFIG_MODULE_SIG_FORCE</code> option in its kernel. We have to sign them with the keys we
enrolled earlier. 
</p>

<pre class="example">
$ sudo add-apt-repository ppa:graphics-drivers/ppa
$ sudo apt update
$ apt-cache search nvidia # find the package name you want
$ sudo apt install nvidia-390
</pre>

<p>
I got burned at some point with hybrid graphics, so I just have them off. Because of that,
I don't want <code>nvidia-prime</code> and <code>bbswitch-dkms</code> installed.
</p>

<pre class="example">
$ sudo apt remove nvidia-prime bbswitch-dkms
</pre>

<p>
We can just copy our keys from arch over to ubuntu.
</p>

<pre class="example">
$ sudo mount -o subvol=jwhendy /mnt
$ mkdir ~/.ssl
$ cp /mnt/.ssl/* ~/.ssl/
</pre>

<p>
Lastly, we need to sign them. Ubuntu ships with it's own script for this, we we can just
use that. It's located at <code>/usr/src/linux-headers-$(uname -r)/scripts/sign-file</code>. I found
arch vs. ubuntu docs a little confusing in this respect. <a href="https://wiki.archlinux.org/index.php/Secure_Boot#Creating_keys">Arch generates</a> a <code>.key</code> and
<code>.crt</code>, then converts the <code>.crt</code> into a DER format <code>.cer</code>. <a href="http://www.pellegrino.link/2015/11/29/signing-nvidia-proprietary-driver-on-fedora.html">References</a> for <a href="https://computerlinguist.org/make-dkms-sign-kernel-modules-for-secure-boot-on-ubuntu-1604.html">how to</a> do this
on ubuntu <a href="https://insights.ubuntu.com/2017/08/11/how-to-sign-things-for-secure-boot">generally show</a> creating a <code>.priv</code> and <code>.der</code> directly. I used my best inference
to sign wit the ubuntu provided tool, using the <code>.key</code> and <code>.cer</code> created earlier. Repeat
the below with <code>nvidia*.ko</code> module:
</p>

<pre class="example">
$ cd /lib/modules/4.13.0-39-generic/updates/dkms
$ sudo /usr/src/linux-headers-4.13.0-39-generic/scripts/sign-file sha256 ~/.ssl/mok_arch.key ~/.ssl/mok_arch.cer nvidia-390.ko
</pre>

<p>
Installing <code>nvidia</code> itself creates a file that blacklists <code>nouveau</code> so all you need to do
is reboot. If you get to a desktop from <code>lightdm</code>, it worked! You can verify with <code>lsmod</code>,
checking to make sure <code>nouveau</code> is not present and <code>nvidia</code> is.
</p>
</div>
</div>


<div id="outline-container-org42ba5a0" class="outline-2">
<h2 id="org42ba5a0">conclusion</h2>
<div class="outline-text-2" id="text-org42ba5a0">
<p>
So that's it! I <i>love</i> using <code>btrfs</code> for this purpose, as you can easily recreate this
process with any number of distros. My use of ubuntu is for the <a href="http://www.ros.org/">Robot Operating System</a>
(ROS) pre-compiled binaries, and with new releases coming from both <a href="http://wiki.ros.org/melodic">ROS</a> and <a href="http://releases.ubuntu.com/18.04/">ubuntu</a> coming,
this is perfect for not having to deal with re-partitioning, worrying about sizing, etc.
</p>
</div>
</div>
