posts/arch-and-ubuntu-side-by-side-on-encrypted-btrfs.org
* notes

- I found that =refind-install= changed the system boot order. I got a little freaked out
  at first, thinking something had been overwritten, but it was fine. You can change this
  via the BIOS or =efibootmgr=.
- the details are a bit over my head, but I believe it will never be possible to chainload
  windows from =rEFInd=. When I try to do this, it asks for the BitLocker password. I
  could find [[https://github.com/systemd/systemd/issues/3948][one other instance]] of this type of behavior. In commenting, it was suggested
  that windows knows if something has intercepted it's own loader and thus it will force
  the password ask.
- in searching around, I founnd various references to bootloader options, but I think
  they're either outdated, or not specific to using the =sd-encrypt= hook. For example
  you'll see =cryptdevice= to specify the UUID of a device and the label to create in
  =/dev/mapper=. [[https://wiki.archlinux.org/index.php/Dm-crypt/Encrypting_an_entire_system#Configuring_the_boot_loader_3][The wiki]] aligns with the fact that =sd-encrypt= uses the options [[https://www.freedesktop.org/software/systemd/man/systemd-cryptsetup-generator.html#][here]]
  instead (like =luks.uuid=). 


* various resources

Other various sites I thought were helpful. This whole exercise felt like putting together
bits and pieces from a lot of places, comparing them, using what was most consistent, etc.

- [[https://askubuntu.com/questions/760671/could-not-load-vboxdrv-after-upgrade-to-ubuntu-16-04-and-i-want-to-keep-secur][Could not load 'vboxdrv' after upgrade to Ubuntu 16.04]]: helped me figure out why
  =nvidia= couldn't be loaded and that signing looked to be similar to signing the kernel
- [[http://www.pellegrino.link/2015/11/29/signing-nvidia-proprietary-driver-on-fedora.html][Signing Nvidia proprietary driver on Fedora]]: just another confirmation of the basic
  signing method on ubuntu (not sure how the =sign-file= script and =sbsign= compare)
- [[https://askubuntu.com/questions/717339/should-i-be-worried-about-warning-checksum-areas-are-greater-than-image-size][warning: checksum areas are greater than image size]]: post about a warning I've seen with
  =sign-file= and =sbsign=. Like it says there, things still worked.
- [[https://github.com/lcp/mokutil][mokutil]]: I didn't end up using it, but some places use =mokutil --import= and other
  commands to deal with the keys. I stuck with =rEFInd='s utility and don't know if this
  does the same thing without having to reboot into said utility or something else.
- [[https://www.rodsbooks.com/refind/][the authoritative rEFInd site]]: site by the author, Rod Smith, which also contains a ton
  of information about Secure Boot as well. His page [[http://www.rodsbooks.com/efi-bootloaders/controlling-sb.html#creatingkeys][on keys]] is a good example of the
  conflicting information out there. While I'm sure his is probably the de facto "right"
  way, it's either more than I needed or for other applications I'm not running into.
