blog/arch-and-ubuntu-side-by-side-on-encrypted-btrfs/index.html

<div id="outline-container-org8f7a10c" class="outline-2">
<h2 id="org8f7a10c">notes</h2>
<div class="outline-text-2" id="text-org8f7a10c">
<ul class="org-ul">
<li>I found that <code>refind-install</code> changed the system boot order. I got a little freaked out
at first, thinking something had been overwritten, but it was fine. You can change this
via the BIOS or <code>efibootmgr</code>.</li>
<li>the details are a bit over my head, but I believe it will never be possible to chainload
windows from <code>rEFInd</code>. When I try to do this, it asks for the BitLocker password. I
could find <a href="https://github.com/systemd/systemd/issues/3948">one other instance</a> of this type of behavior. In commenting, it was suggested
that windows knows if something has intercepted it's own loader and thus it will force
the password ask.</li>
<li>in searching around, I founnd various references to bootloader options, but I think
they're either outdated, or not specific to using the <code>sd-encrypt</code> hook. For example
you'll see <code>cryptdevice</code> to specify the UUID of a device and the label to create in
<code>/dev/mapper</code>. <a href="https://wiki.archlinux.org/index.php/Dm-crypt/Encrypting_an_entire_system#Configuring_the_boot_loader_3">The wiki</a> aligns with the fact that <code>sd-encrypt</code> uses the options <a href="https://www.freedesktop.org/software/systemd/man/systemd-cryptsetup-generator.html#">here</a>
instead (like <code>luks.uuid</code>).</li>
</ul>
</div>
</div>


<div id="outline-container-org9aeec40" class="outline-2">
<h2 id="org9aeec40">various resources</h2>
<div class="outline-text-2" id="text-org9aeec40">
<p>
Other various sites I thought were helpful. This whole exercise felt like putting together
bits and pieces from a lot of places, comparing them, using what was most consistent, etc.
</p>

<ul class="org-ul">
<li>
<a href="https://askubuntu.com/questions/760671/could-not-load-vboxdrv-after-upgrade-to-ubuntu-16-04-and-i-want-to-keep-secur">Could not load 'vboxdrv' after upgrade to Ubuntu 16.04</a>: helped me figure out why
<code>nvidia</code> couldn't be loaded and that signing looked to be similar to signing the kernel</li>
<li>
<a href="http://www.pellegrino.link/2015/11/29/signing-nvidia-proprietary-driver-on-fedora.html">Signing Nvidia proprietary driver on Fedora</a>: just another confirmation of the basic
signing method on ubuntu (not sure how the <code>sign-file</code> script and <code>sbsign</code> compare)</li>
<li>
<a href="https://askubuntu.com/questions/717339/should-i-be-worried-about-warning-checksum-areas-are-greater-than-image-size">warning: checksum areas are greater than image size</a>: post about a warning I've seen with
<code>sign-file</code> and <code>sbsign</code>. Like it says there, things still worked.</li>
<li>
<a href="https://github.com/lcp/mokutil">mokutil</a>: I didn't end up using it, but some places use <code>mokutil --import</code> and other
commands to deal with the keys. I stuck with <code>rEFInd</code>'s utility and don't know if this
does the same thing without having to reboot into said utility or something else.</li>
<li>
<a href="https://www.rodsbooks.com/refind/">the authoritative rEFInd site</a>: site by the author, Rod Smith, which also contains a ton
of information about Secure Boot as well. His page <a href="http://www.rodsbooks.com/efi-bootloaders/controlling-sb.html#creatingkeys">on keys</a> is a good example of the
conflicting information out there. While I'm sure his is probably the de facto "right"
way, it's either more than I needed or for other applications I'm not running into.</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/linux/" rel="tag">linux</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../comparing-python-plotting-libraries/" rel="prev" title="Comparing python plotting libraries">Previous post</a>
            </li>
        </ul></nav></aside></article>
</div>
    </div>
    <!--End of body content-->
</div>
<div class="footerbox">
    Contents © 2020         <a href="mailto:jw.hendy@gmail.com">John Henderson</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
    
</div>

            <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
